[{"uuid":"4f09c857-999f-424a-aa22-70f3c6431395","title":"The Life and Times of Major Fiction","publicationDate":"1986","description":"Fourteen stories use images of comedy and nightmare to deal with parents, children, love, marriage, passion, and divorce","authors":"Jonathan Baumbach","category":"fiction","imageUrl":"/images/4f09c857-999f-424a-aa22-70f3c6431395.jpg","price":"25.99","created_at":1704770162057,"updated_at":1704770162057},{"uuid":"91d39df0-130f-48bc-b7fb-a4a5a3898b23","title":"Astounding Science-fiction","publicationDate":"1951","authors":"","category":"fiction","imageUrl":"/images/91d39df0-130f-48bc-b7fb-a4a5a3898b23.jpg","price":"25.99","created_at":1704770162588,"updated_at":1704770162588},{"uuid":"41c3e0d9-b088-48fd-b3b1-c847c3aad60d","title":"History of Fiction in China","description":"The book provides highlights on the key concepts and trends of evolution in History of Fiction in China, as one of the series of books of “China Classified Histories”.","authors":"Zhi Dao","category":"fiction","imageUrl":"/images/41c3e0d9-b088-48fd-b3b1-c847c3aad60d.jpg","price":"25.99","created_at":1704770163205,"updated_at":1704770163205},{"uuid":"82ed9b99-888c-4fb1-9531-29bfdc634d9e","title":"Climate Fiction and Cultural Analysis","publicationDate":"2019-09-25","description":"Climate Fiction and Cultural Analysis argues that the popularity of the term \"climate fiction\" has paradoxically exhausted the term’s descriptive power and that it has developed into a black box containing all kinds of fictions which depict climatic events and has consequently lost its true significance. Aware of the prospect of ecological collapse as well as our apparent inability to avert it, we face geophysical changes of drastic proportions that severely challenge our ability to imagine the consequences. This book argues that this crisis of imagination can be partly relieved by climate fiction, which may help us comprehend the potential impact of the crisis we are facing. Strictly assigning \"climate fiction\" to fictions that incorporate the climatological paradigm of anthropogenic global warming into their plots, this book sets out to salvage the term’s speculative quality. It argues that climate fiction should be regarded as no less than a vital supplement to climate science, because climate fiction makes visible and conceivable future modes of existence within worlds not only deemed likely by science, but which are scientifically anticipated. Focusing primarily on English and German language fictions, Climate Fiction and Cultural Analysis shows how Western climate fiction sketches various affective and cognitive relations to the world in its utilization of a small number of recurring imaginaries, or imagination forms. This book will be of great interest to students and scholars of ecocriticism, the environmental humanities, and literary and culture studies more generally.","authors":"Gregers Andersen","category":"fiction","imageUrl":"/images/82ed9b99-888c-4fb1-9531-29bfdc634d9e.jpg","price":"25.99","created_at":1704770164245,"updated_at":1704770164245},{"uuid":"2d3e227e-ae38-44bf-a99b-ed10f1a47423","title":"Reading and Mapping Fiction","publicationDate":"2020-07-02","description":"This book explores the power of the map in fiction and its centrality to meaning, from Treasure Island to Winnie-the-Pooh.","authors":"Sally Bushell","category":"fiction","imageUrl":"/images/2d3e227e-ae38-44bf-a99b-ed10f1a47423.jpg","price":"25.99","created_at":1704770164821,"updated_at":1704770164821},{"uuid":"afec80b5-6998-4755-9ae4-f7c08b840309","title":"The Craft of Fiction","publicationDate":"1984","description":"A biography of the British boy, captured by raiding Irish warriors at age sixteen, who performed miracles, ended the power of the Druid priests over the Irish people, and converted the Irish kings and their people to Christianity.","authors":"Leigh A. Arrathoon","category":"fiction","imageUrl":"/images/afec80b5-6998-4755-9ae4-f7c08b840309.jpg","price":"25.99","created_at":1704770165351,"updated_at":1704770165351},{"uuid":"131ef185-88e4-44e4-9523-b3eeb6e61d80","title":"Desire and Domestic Fiction","publicationDate":"1987-05-07","description":"\"A strikingly original treatment of the rise of the novel, Desire and Domestic Fiction makes a major contribution to feminist theory, to the understanding of the role of gender in culture and its relation to political change, and to studies in the history of the British novel. Its successful application of contemporary theory, especially its use of Foucault's History of Sexuality, will interest scholars involved in the criticism of culture\"--Jacket.","authors":"Nancy Armstrong","category":"fiction","imageUrl":"/images/131ef185-88e4-44e4-9523-b3eeb6e61d80.jpg","price":"25.99","created_at":1704770165882,"updated_at":1704770165882},{"uuid":"6c0e8470-8016-4f0c-a433-80e7fbe59063","title":"British Historical Fiction before Scott","publicationDate":"2010-04-09","description":"In the half century before Walter Scott's Waverley , dozens of popular novelists produced historical fictions for circulating libraries. This book examines eighty-five popular historical novels published between 1762 and 1813, looking at how the conventions of the genre developed through a process of imitation and experimentation.","authors":"A. Stevens","category":"fiction","imageUrl":"/images/6c0e8470-8016-4f0c-a433-80e7fbe59063.jpg","price":"25.99","created_at":1704770166479,"updated_at":1704770166479},{"uuid":"7872ea17-3893-4db5-a558-ddd445ef0fd8","title":"Exploring Science Through Science Fiction","publicationDate":"2019-11-01","description":"How does Einstein’s description of space and time compare with Doctor Who? Can James Bond really escape from an armor-plated railroad car by cutting through the floor with a laser concealed in a wristwatch? What would it take to create a fully intelligent android, such as Star Trek’s Commander Data? Exploring Science Through Science Fiction addresses these and other intriguing questions, using science fiction as a springboard for discussing fundamental science concepts and cutting-edge science research. It includes references to original research papers, landmark scientific publications and technical documents, as well as a broad range of science literature at a more popular level. The revised second edition includes expanded discussions on topics such as gravitational waves and black holes, machine learning and quantum computing, gene editing, and more. In all, the second edition now features over 220 references to specific scenes in more than 160 sci-fi movies and TV episodes, spanning over 100 years of cinematic history. Designed as the primary text for a college-level course, this book will appeal to students across the fine arts, humanities, and hard sciences, as well as any reader with an interest in science and science fiction. Praise for the first edition: \"This journey from science fiction to science fact provides an engaging and surprisingly approachable read...\" (Jen Jenkins, Journal of Science Fiction, Vol. 2 (1), September 2017)","authors":"Barry B. Luokkala","category":"fiction","imageUrl":"/images/7872ea17-3893-4db5-a558-ddd445ef0fd8.jpg","price":"25.99","created_at":1704770167542,"updated_at":1704770167542},{"uuid":"805785e9-91c8-43cb-b411-36ba55b9bcdc","title":"Genesis: History, Fiction, or Neither?","publicationDate":"2015-05-12","description":"The nature of the Genesis narrative has sparked much debate among Christians. This book introduces three predominant interpretive genres and their implications for biblical understanding. Each contributor identifies their position on the genre or genres of Genesis, chapters 1-11, addresses why their interpretation is respectful of and appropriate to the text, and contributes examples of its application to a variety of passages. The positions include: Theological History(Genesis can be taken seriously as both history and theology) – defended by James K. Hoffmeier. Proto-History (the early Genesis narratives consist of a variety of literary genres; which, nonetheless, do not obscure the book's theological teaching) – defended by Gordon J. Wenham. Ancient Historiography (an understanding of Genesis that seeks to reconcile the limitations of its human authors with the nature of it being the Word of God) defended by Kenton L. Sparks. General editor and Old Testament scholar Charles Halton explains the importance of genre and provides historical insight in the introduction and helpful summaries of each position in the conclusion. In the reader-friendly Counterpoints format, this book helps readers to reflect on the strengths and weaknesses of each view and draw informed conclusions in this much-debated topic.","authors":"James K. Hoffmeier, Gordon John Wenham, Kenton Sparks","category":"fiction","imageUrl":"/images/805785e9-91c8-43cb-b411-36ba55b9bcdc.jpg","price":"25.99","created_at":1704770168473,"updated_at":1704770168473},{"uuid":"0cf4d541-b381-440f-8d13-329f46e6f3b4","title":"The Power of Satire","publicationDate":"2015-10-15","description":"Satire is clearly one of today’s most controversial socio-cultural topics. In this edited volume, The Power of Satire, it is studied for the first time as a dynamic, discursive mode of performance with the power of crossing and contesting cultural boundaries. The collected essays reflect the fundamental shift from literary satire or straightforward literary rhetoric with a relatively limited societal impact, to satire’s multi-mediality in the transnational public space where it can cause intercultural clashes and negotiations on a large scale. An appropriate set of heuristic themes – space, target, rhetoric, media, time – serves as the analytical framework for the investigations and determines the organization of the book as a whole. The contributions, written by an international group of experts with diverse disciplinary backgrounds, manifest academic standards with a balance between theoretical analyses and evaluations on the one hand, and in-depth case studies on the other.","authors":"Marijke Meijer Drees, Sonja de Leeuw","category":"satire","imageUrl":"/images/0cf4d541-b381-440f-8d13-329f46e6f3b4.jpg","price":"25.99","created_at":1704770169624,"updated_at":1704770169624},{"uuid":"27d0ba18-261e-4b73-bf3f-6accdb39c27c","title":"Roman Satire","publicationDate":"1975","description":"This general study of Roman satire both describes the historical development of Roman verse satire as a homogenous genre and examines the great Roman satiric poets as individuals.","authors":"Ulrich Knoche","category":"satire","imageUrl":"/images/27d0ba18-261e-4b73-bf3f-6accdb39c27c.jpg","price":"25.99","created_at":1704770169884,"updated_at":1704770169884},{"uuid":"43e57ddd-7c5c-4860-9a71-2d5a829df857","title":"Satire Newsletter","publicationDate":"1971","authors":"","category":"satire","imageUrl":"/images/43e57ddd-7c5c-4860-9a71-2d5a829df857.jpg","price":"25.99","created_at":1704770170404,"updated_at":1704770170404},{"uuid":"5f6e2df6-7f05-4cfc-90a8-cb43b0aa89fa","title":"Techniques of Satire","publicationDate":"1994","authors":"Emil Draitser","category":"satire","imageUrl":"/images/5f6e2df6-7f05-4cfc-90a8-cb43b0aa89fa.jpg","price":"25.99","created_at":1704770171055,"updated_at":1704770171055},{"uuid":"84e90739-fa56-40dc-9be1-dbc1e0600076","title":"Satire and the Postcolonial Novel","publicationDate":"2003","description":"First Published in 2003. Routledge is an imprint of Taylor & Francis, an informa company.","authors":"John Clement Ball","category":"satire","imageUrl":"/images/84e90739-fa56-40dc-9be1-dbc1e0600076.jpg","price":"25.99","created_at":1704770171977,"updated_at":1704770171977},{"uuid":"ec07936a-6c2e-4f77-8289-72cede049a61","title":"Persius and the Programmatic Satire","publicationDate":"2007-07-26","description":"A critical study of Persius' poetic aims, aversions and techniques, based mainly on an extended analysis of Satires I. John Bramble shows how Persius' discontent with conventional literary language led him to compress the existing satiric idiom and create a powerful individual style. The author situates Persius' work in the tradition of Roman satire, and shows how he takes the concepts and metaphors of literary criticism back to their physical origins, to indict moral and literary decadence through a series of images connected with, for example, gluttony and sexual excess. This is a model study of a classical text, which makes consistent sense of a difficult and subtle manner, and answers questions posed by the potentially constricting nature of Roman poetic form. It also reconstructs the referential framework of ideas and associations upon which a sophisticated writer addressing a discriminating audience could draw.","authors":"J. C. Bramble","category":"satire","imageUrl":"/images/ec07936a-6c2e-4f77-8289-72cede049a61.jpg","price":"25.99","created_at":1704770172866,"updated_at":1704770172866},{"uuid":"05a8a2dc-f15f-438d-a02e-0410c8b9fd97","title":"Satire Newsletter","publicationDate":"1966","authors":"","category":"satire","imageUrl":"/images/05a8a2dc-f15f-438d-a02e-0410c8b9fd97.jpg","price":"25.99","created_at":1704770173386,"updated_at":1704770173386},{"uuid":"2ea6d516-03af-4061-8cb6-43bee7ee31f8","title":"African American Satire","publicationDate":"2001","description":"\"Satire's real purpose as a literary genre is to criticize through humor, irony, caricature, and parody, and ultimately to defy the status quo. In African American Satire, Darryl Dickson-Carr provides the first book-length study of African-American satire and the vital role it has played. In the process he investigates African American literature, American literature, and the history of satire.\" --Book Jacket.","authors":"Darryl Dickson-Carr","category":"satire","imageUrl":"/images/2ea6d516-03af-4061-8cb6-43bee7ee31f8.jpg","price":"25.99","created_at":1704770173711,"updated_at":1704770173711},{"uuid":"ba69073b-211a-4163-9bb4-81608f9d5d70","title":"The Schoolmaster in Comedy and Satire","publicationDate":"1894","authors":"Hubert Marshall Skinner","category":"satire","imageUrl":"/images/ba69073b-211a-4163-9bb4-81608f9d5d70.jpg","price":"25.99","created_at":1704770173930,"updated_at":1704770173930},{"uuid":"b1882952-72c4-46f1-bcde-7bbc7dc766aa","title":"The Literature of Satire","publicationDate":"2004-02-12","description":"The Literature of Satire is an accessible but sophisticated and wide-ranging study of satire from the classics to the present in plays, novels and the press as well as in verse. In it Charles Knight analyses the rhetorical problems created by satire's complex relations to its community, and examines how it exploits the genres it borrows. He argues that satire derives from an awareness of the differences between appearance, ideas and discourse. Knight provides illuminating readings of such satirists familiar and unfamiliar as Horace, Lucian, Jonson, Molière, Swift, Pope, Byron, Flaubert, Ostrovsky, Kundera, and Rushdie. This broad-ranging examination sheds light on the nature and functions of satire as a mode of writing, as well as on theoretical approaches to it. It will be of interest to scholars interested in literary theory as well as those specifically interested in satire.","authors":"Charles A. Knight","category":"satire","imageUrl":"/images/b1882952-72c4-46f1-bcde-7bbc7dc766aa.jpg","price":"25.99","created_at":1704770174601,"updated_at":1704770174601},{"uuid":"6d493591-ceee-404f-a9b5-03b18b88da3b","title":"Fresh Slices","publicationDate":"2014-08-14","description":"Slices of life beyond the tourist's view. By turns funny, tough, and somber, the twenty-one helpings of New York attitude in Fresh Slices reveal neighborhoods both rich and poor, where old-timers desperately protect their secrets and brand-new arrivals indulge dangerous appetites. There is as much variety in the tones, settings, and approaches as in Gotham itself, and yet each of these crime stories also reflects the city's most infectious and unifying principle, that special combination of adaptability and assertiveness dished out more often than any pizza or street meat. In this, Fresh Slices’ second edition, urban short stories offer action-packed mystery that moves from cozy to noir. The sleuths, police officers and investigators who grapple with crime in these pages are richly drawn and engagingly authentic. Written by local members of the New York / Tri-State chapter of Sisters in Crime the anthology and edited by Agatha nominee Terrie Farley Moran, Fresh Slices is second in the Murder New York series and features tales from the most ethnically diverse and densely populated city in America.","authors":"New York Tri-State Chapter of Sisters in Crime, Terrie Farley Moran, Clare Toohey, Catherine Maiorisi, Cynthia Benjamin, Susan Chalfin, Fran Cox, Laura K. Curtis, Eileen Dunbaugh, Lois Karlin, Lynne Lederman, Leigh Neely, Anita Page, Triss Stein, Cathi Stoler, Anne-Marie Sutton, Joan Tuohy, Deirdre Verne, Stephanie Wilson-Flaherty, Lina Zeldovich, Elizabeth Zelvin, K.J.A. Wishnia","category":"mystery","imageUrl":"/images/6d493591-ceee-404f-a9b5-03b18b88da3b.jpg","price":"25.99","created_at":1704770175881,"updated_at":1704770175881},{"uuid":"f8174acd-180b-476f-9112-839dbad761d7","title":"A Year in Europe Mystery Bundle: Vengeance in Vienna (#3) and A Fatality in Spain (#4)","publicationDate":"2021-10-15","description":"A bundle of VENGEANCE IN VIENNA (Book #3) and A FATALITY IN SPAIN (Book #4) in Blake Pierce’s A Year in Europe Mystery series! This bundle offers books three and four in one convenient file, with over 100,000 words of reading. In VENGEANCE IN VIENNA (Book #3), Diana travels to Vienna, hoping to fulfill her bucket list dream of being moved to tears by music. She is overwhelmed by the beauty, history and culture of the city and wonders if she’s finally settling into her trip in Europe—when an unforeseen catastrophe turns her plans upside down. Can Diana investigate her way out of this one? In A FATALITY IN SPAIN (Book #4), Diana decides to let go and take a chance at love, meeting up with her newfound friend in Barcelona, and trying to muster the courage to fulfill her lifelong dream of running with the bulls in Pamplona. Between the great food, the sunny streets, and her new love, life seems alive again—until a murder turns her world upside down. Can Diana save the case and herself—along with her summer? A YEAR IN EUROPE is a charming and laugh-out-loud cozy mystery series, packed with food and travel, with mysteries that will leave you on the edge of your seat, and with experiences that will leave you with a sense of wonder. As Diana embarks on her quixotic quest for love and meaning, you will find yourself falling in love and rooting for her. You will be in shock at the twists and turns her journey takes as she somehow finds herself at the center of a mystery, and must play amateur sleuth to solve it. Fans of books like Eat, Pray, Love and Under the Tuscan Sun have finally found the cozy mystery series they’ve been hoping for!","authors":"Blake Pierce","category":"mystery","imageUrl":"/images/f8174acd-180b-476f-9112-839dbad761d7.jpg","price":"25.99","created_at":1704770176900,"updated_at":1704770176900},{"uuid":"620738db-dd2b-43ab-b0ad-9cfd4352f110","title":"The P'town Murders","publicationDate":"2007","description":"Secret agent Brad Fairfax is summoned by a mysterious voice to come to Cape Cod to claim the body of his ex-lover and best friend. On site he discovers that Ross was murdered, the first in a string of four corpses to show up. Victims and suspects have two points in common: they are all connected to a gay guesthouse for wealthy clients where anything is permitted, and most have some connection to Buddhism. Although Brad investigates on his own, his boss at the mysterious agency for which he works feels certain the murderer is implicated in an assassination plot against the Dalai Lama, who is to speak soon in New York's Central Park. The possibility of romance comes with the appearance of a young, blue-haired Buddhist. But Brad will have to learn the meaning of trust and to overcome his irrational bouts of jealousy before there can be any hope of a real connection.","authors":"Jeffrey Round","category":"mystery","imageUrl":"/images/620738db-dd2b-43ab-b0ad-9cfd4352f110.jpg","price":"25.99","created_at":1704770177952,"updated_at":1704770177952},{"uuid":"afb52552-78b0-4eaf-824f-c956502ab3ba","title":"Death at an English Wedding","publicationDate":"2017-06-30","description":"Tying the knot was never so deadly . . . Wedding bells are ringing for location scouts Kate and Alex in a ceremony at one of England’s most elegant stately homes, but when a guest is murdered and suspicion falls on those closest to Kate, she and Alex must put their plans for happily ever after on hold. If they can’t figure out who sabotaged their big day, their honeymoon may be over before it begins. Death at an English Wedding is the seventh installment in the popular Murder on Location series from USA Today bestselling author Sara Rosett, which features an English village and quirky characters along with dashes of humor and romance. Indulge your inner Anglophile with Sara Rosett’s English village cozy today! MURDER ON LOCATION SERIES: Book One - Death in the English Countryside Book Two - Death in an English Cottage Book Three - Death in a Stately Home Book Four - Death in an Elegant City Book Five - Menace at the Christmas Market (Novella) Book Six - Death in an English Garden Book Seven - Death at an English Wedding Have you read Sara Rosett’s other mystery series? If you like historical mysteries with lady detectives, check out the HIGH SOCIETY LADY DETECTIVE mystery series. If you like travel with your mystery, check out the ON THE RUN INTERNATIONAL MYSTERIES.","authors":"Sara Rosett","category":"mystery","imageUrl":"/images/afb52552-78b0-4eaf-824f-c956502ab3ba.jpg","price":"25.99","created_at":1704770178971,"updated_at":1704770178971},{"uuid":"b42e05f4-c656-4567-b465-b83cbfe77ef1","title":"Couldn't Cheat Death","publicationDate":"2020-08-19","description":"Detective Paul Monroe has little room in his life for anything but work. Maintaining order and solving cases in the town of Thornwood Park keeps him busy. When Jerry Gregoria, a popular bartender and personal trainer is found murdered, there’s no shortage of suspects. It seems Jerry was busy shaking more than cocktails all over town, leaving Paul and his partner with an ever-growing list of men and women who have reasons to want Jerry dead. The deeper Paul delves into the case, the more he finds himself drawn to hotel manager Cliff Baxter, whom he hasn’t seen in years. Cliff Baxter’s childhood crush on Paul Monroe hasn’t waned since high school. In fact, with the sexy detective conducting the investigation at the hotel, Cliff is more than happy to help. Ever since his last relationship went up in flames, Cliff has made it a rule to never get involved with a closeted man. But after Paul is threatened and things between the two heat up, Cliff decides to make an exception. With new twists in the case popping up every day and the mayor breathing down the police department’s neck, Paul needs to solve the case yesterday. It takes a crisis for Paul and Cliff to realize what started out as something casual could be everything they’ve both been looking for but never thought to find. But if the killer strikes again, they might never get that chance.","authors":"Felice Stevens, A.P. Eisen","category":"mystery","imageUrl":"/images/b42e05f4-c656-4567-b465-b83cbfe77ef1.jpg","price":"25.99","created_at":1704770179546,"updated_at":1704770179546},{"uuid":"085a2677-04ee-4cfd-8917-d27b328a9bbe","title":"MYSTERY & DETECTIVE COLLECTION: The Winning Clue, Mrs. Marden's Ordeal, No Clue & The Man Who Forgot (Thriller Classics Series)","publicationDate":"2016-07-17","description":"This carefully crafted ebook: \"MYSTERY & DETECTIVE COLLECTION: The Winning Clue, Mrs. Marden's Ordeal, No Clue & The Man Who Forgot (Thriller Classics Series)\" is formatted for your eReader with a functional and detailed table of contents: \"The Winning Clue\" - Enid Withers is found dead and amateur detective Lawrence Bristow takes up on a challenge to solve the mystery of her murder. But after hitting few dead ends, Bristow is joined by a professional investigator Samuel Braceway. Both have their unique ways and different theories, and believe the other one is on the wrong trail. \"No Clue!\" - Detective Jefferson Hastings is invited at Sloanehurst, home of Arthur Sloane, rich and eccentric man deeply interested in study of crime and criminals. During his stay at Sloanehurst a young woman is found dead at the estate and Sloane's daughter wants Hastings to help solving mystery of the murder. In the beginning it appears that there are no clues at all, and every suspect has a perfect alibi… \"Mrs. Marden's Ordeal\" - Ruth Marden was disappointed with her marriage and her husband George whose affairs with other women led them to a verge of divorce, but his relationship with Marjorie Nesbit was the thing that troubled Ruth the most. After a party thrown by Ruth and George, Marjorie is found dead… \"The Man Who Forgot\" - An alcoholic gets himself to a point where he is unable to recall his own name or anything at all about his past. James Hay, Jr. (1881–1936) was American novelist and journalist, born in Harrisonburg, Virginia. Most of his books are crime mysteries and detective stories, some of which are set in Asheville, place where he spent part of his life, and worked as an editor in the Asheville Citizen magazine. Some of his other detective novels have their settings in Washington, where Hay spent his final years. Hay was the founder of the National Press Club, and had friendly relations with presidents Wilson and Taft.","authors":"James Hay","category":"mystery","imageUrl":"/images/085a2677-04ee-4cfd-8917-d27b328a9bbe.jpg","price":"25.99","created_at":1704770180251,"updated_at":1704770180251},{"uuid":"a03c708e-fdb8-488f-a272-759a0b2652b5","title":"Kissing Christmas Goodbye","publicationDate":"2007-10-02","description":"Kissing Christmas Goodbye continues the tradition in M. C. Beaton's beloved Agatha Raisin mystery cozy series—now a hit show on Acorn TV and public television. Unlike quite a number of people, Agatha had not given up on Christmas. To have the perfect Christmas had been a childhood dream whilst surviving a rough upbringing in a Birmingham slum. Holly berries glistened, snow fell gently outside, and inside, all was Dickensian jollity. And in her dreams, James Lacey kissed her under the mistletoe, and, like a middle-aged sleeping beauty, she would awake to passion once more.... Agatha Raisin is bored. Her detective agency in the Cotswolds is thriving, but she'll scream if she has to deal with another missing cat or dog. Only two things seem to offer potential excitement: the upcoming Christmas festivities and her ex, James Lacey. This year she is sure that if she invites James to a really splendid, old-fashioned Christmas dinner, their love will rekindle like a warm Yule log. When a wealthy widow hires Agatha because she's convinced a member of her family is trying to kill her, Agatha is intrigued---especially when the widow drops dead after high tea at the manor house. Who in this rather sterile house, complete with fake family portraits, could have hated the old lady enough to poison her? Agatha sets out to find the murderer, all the while managing a pretty, teenage trainee who makes her feel old and planning for a picture-perfect Christmas, with James, all the trimmings, and perhaps even snow.","authors":"M. C. Beaton","category":"mystery","imageUrl":"/images/a03c708e-fdb8-488f-a272-759a0b2652b5.jpg","price":"25.99","created_at":1704770180999,"updated_at":1704770180999},{"uuid":"eb1c29a0-77d1-4745-babc-3d8c0ad99517","title":"Crime in the Café (A Lacey Doyle Cozy Mystery—Book 3)","publicationDate":"2020-03-31","description":"\"Very entertaining. I highly recommend this book to the permanent library of any reader that appreciates a very well written mystery, with some twists and an intelligent plot. You will not be disappointed. Excellent way to spend a cold weekend!\" --Books and Movie Reviews, Roberto Mattos (regarding Murder in the Manor) CRIME IN THE CAFE (A LACEY DOYLE COZY MYSTERY—BOOK 3) is book three in a charming new cozy mystery series by Fiona Grace. Lacey Doyle, 39 years old and freshly divorced, has made a drastic change: she has walked away from the fast life of New York City and settled down in the quaint English seaside town of Wilfordshire. Summer is nearly here, and Lacey has fallen more in love with the town and with her chef boyfriend. She has even made a best friend: the new owner of a local B&B. And when her friend needs her services for the decoration of her inn, buying nearly everything in Lacey’s antique shop, her business even gets an extra boost. Everything’s going perfectly—until someone mysteriously dies in her friend’s new B&B. Their village turned upside down and her new friend’s livelihood now in jeopardy, it’s up to Lacey and her dog to get to the bottom of the mystery. Books #4-#9 are also available!","authors":"Fiona Grace","category":"mystery","imageUrl":"/images/eb1c29a0-77d1-4745-babc-3d8c0ad99517.jpg","price":"25.99","created_at":1704770181281,"updated_at":1704770181281},{"uuid":"dab6179f-12f2-4b95-9a3b-6e5122b56926","title":"The Literature of Mystery","publicationDate":"1969","authors":"","category":"mystery","imageUrl":"/images/dab6179f-12f2-4b95-9a3b-6e5122b56926.jpg","price":"25.99","created_at":1704770181801,"updated_at":1704770181801},{"uuid":"41215325-aae5-4438-b86b-a9b0f84d5b48","title":"High Beam","publicationDate":"2014-08-15","description":"Something is very rotten in the state of Tasmania. Brad Finch, the marquee player of the Tassie Devils Football Club, is the victim at the heart of a new murder mystery. Intense media scrutiny, interfering superior officers, and corrupt business interests all threaten to derail the homicide investigation conducted by the Serious Crimes Squad. Forensic analysis, dogged detective work, and inspiration may prove insufficient in the search for the true perpetrators. The team must face unpalatable truths about the nature of professional sport and the exercise of power in modern Australian society. Detective Inspector John Mahoney, the hero of this international crime series of police procedurals, is an outsider in his hometown of Hobart. Disillusioned by his private life and shocked by the corruption he unearths, he queries his capacity to continue in the job. He must decide if he has the courage to “speak truth to power.”","authors":"SJ Brown","category":"mystery","imageUrl":"/images/41215325-aae5-4438-b86b-a9b0f84d5b48.jpg","price":"25.99","created_at":1704770182485,"updated_at":1704770182485},{"uuid":"367cc30b-edee-4000-998a-6f0bac3ee742","title":"Catalog of the Theatre and Drama Collections","publicationDate":"1967","authors":"New York Public Library. Research Libraries","category":"drama","imageUrl":"/images/367cc30b-edee-4000-998a-6f0bac3ee742.jpg","price":"25.99","created_at":1704770183558,"updated_at":1704770183558},{"uuid":"fde0b6fa-a2d0-4ce3-add2-1fc6e09b4bb4","title":"The Politics and Reception of Rabindranath Tagore's Drama","publicationDate":"2014-12-05","description":"This is the first volume to focus specifically on Rabindranath Tagore’s dramatic literature, visiting translations and adaptations of Tagore’s drama, and cross-cultural encounters in his works. As Asia’s first Nobel Laureate, Tagore’s highly original plays occupy a central position in the Indian theatrescape. Tagore experimented with dance, music, dance drama, and plays, exploring concepts of environment, education, gender and women, postcolonial encounters, romantic idealism, and universality. Tagore’s drama plays a generous host to experimentations with new performance modes, like the writing and staging of an all-women play on stage for the first time, or the use of cross-cultural styles such as Manipuri dance, Thai craft in stage design, or the Baul singing styles. This book is an exciting re-exploration of Tagore’s plays, visiting issues such as his contribution to Indian drama, drama and environment, feminist readings, postcolonial engagements, cross-cultural encounters, drama as performance, translational and adaptation modes, the non-translated or the non-translatable Tagore drama, Tagore drama in the 21st century, and Indian film. The volume serves as a wide-ranging and up-to-date resource on the criticism of Tagore drama, and will appeal to a range of Theatre and Performance scholars as well as those interested in Indian theatre, literature, and film.","authors":"Arnab Bhattacharya, Mala Renganathan","category":"drama","imageUrl":"/images/fde0b6fa-a2d0-4ce3-add2-1fc6e09b4bb4.jpg","price":"25.99","created_at":1704770184881,"updated_at":1704770184881},{"uuid":"7a8188e0-4605-4b97-ac88-18bfac656196","title":"Story Drama in the Special Needs Classroom","publicationDate":"2012-01-15","description":"Introducing drama to the learning experience is guaranteed to enrich a child's development, and is an especially effective approach for children with special educational needs, including those with autism spectrum disorders. This practical handbook offers teachers an array of simple and easy-to-implement theatrical techniques that will enhance students' learning and encourage artistic expression. The author demonstrates how dramatic play doesn't have to be restricted to drama lessons and can be applied to a diverse range of school subjects and recreational settings. 'The Little Red Hen', for example, covers themes that are relevant to literacy (rhyming and rhythm), maths (counting seeds), science (discussing farming), and art lessons (designing costumes). Step-by-step lesson plans take teachers through every aspect of running fun and engaging story dramas, including warm ups, movement, songs and props. Handy tips throughout suggest ideas for developing the plays further and ways to adapt them according to the needs of the group. This book will be an essential and comprehensive guide for anyone interested in drama as an educational tool in inclusive or special needs settings.","authors":"Jessica Perich Carleton","category":"drama","imageUrl":"/images/7a8188e0-4605-4b97-ac88-18bfac656196.jpg","price":"25.99","created_at":1704770185640,"updated_at":1704770185640},{"uuid":"329edf52-cfb1-45ab-a8d2-5cc1eaf309af","title":"How to write good drama story","authors":"Zafar Yab","category":"drama","imageUrl":"/images/329edf52-cfb1-45ab-a8d2-5cc1eaf309af.jpg","price":"25.99","created_at":1704770186648,"updated_at":1704770186648},{"uuid":"bc85cfd1-4660-4340-b24b-3b845fa7c3f0","title":"Putting Process Drama into Action","publicationDate":"2017-07-06","description":"This new book provides a clear and accessible guide on best practice to support teachers when using process drama in establishing creative learning partnerships with their students. It offers a detailed analysis and explores the roles of actor, director and playwright that the teacher must adopt in order to develop the ‘thinking on your feet’ skills and knowledge necessary to deliver a complete process drama experience. Addressing the dynamic nature of process drama, it provides a clear and rigorous explanation of the theory of process drama and links it to practice. Drawing on a wide range of detailed examples from the authors’ international and cross-cultural practice, it demonstrates how an effective process drama operates in action. Written to help practitioners and students produce powerful, artistic and educative experiences, chapters cover: pedagogy and the improvised nature of the art form; the structural framework and making shifts in the drama; the role of actor, director, playwright and teacher; monitoring emotional range; progression and the importance of reflection; the spiral of creative exchange and the complexities of co-creativity. Putting Process Drama into Action will be an essential guide for students undertaking initial teacher training at primary level, in addition to those studying both Drama and English at secondary level. It will also prove to be essential reading for specialist and non-specialist teachers in the primary and secondary sectors who teach, or wish to teach, process drama.","authors":"Pamela Bowell, Brian S. Heap","category":"drama","imageUrl":"/images/bc85cfd1-4660-4340-b24b-3b845fa7c3f0.jpg","price":"25.99","created_at":1704770187701,"updated_at":1704770187701},{"uuid":"4f078ffa-28d6-4a31-bfdc-6ac420e14fa6","title":"Research Opportunities in Renaissance Drama","publicationDate":"1979","description":"Vols. for 1972/73 are the reports of the Modern Language Association seminar.","authors":"","category":"drama","imageUrl":"/images/4f078ffa-28d6-4a31-bfdc-6ac420e14fa6.jpg","price":"25.99","created_at":1704770188221,"updated_at":1704770188221},{"uuid":"99d2c03a-594c-436e-99e0-94c9be088d4d","title":"Post-Colonial English Drama","publicationDate":"1993-02-12","description":"Post-Colonial English Drama is the first critical survey of contemporary Commonwealth drama. Besides essays on such individual dramatists as Wole Soyinka, Derek Walcott, David Williamson, Louis Nowra, Athol Fugard, George Walker, Sharon Pollock and Judith Thompson there are surveys of the dramatic literature and developments in the theatre in Australia, Canada, India, New Zealand, South Africa, Papua New Guinea, Ghana, Nigeria, Jamaica and Trinidad. Canadian woman dramatists and the new radical South African theatre are also among the topics.","authors":"Bruce King","category":"drama","imageUrl":"/images/99d2c03a-594c-436e-99e0-94c9be088d4d.jpg","price":"25.99","created_at":1704770188915,"updated_at":1704770188915},{"uuid":"6b82440f-1c99-4dea-97b2-00d5fb82aa42","title":"A Drama of the Southwest","publicationDate":"2016","description":"This book, a critical edition of a previously unpublished 1935 manuscript, makes A Drama of the Southwest available to readers for the first time.","authors":"Jean Toomer","category":"drama","imageUrl":"/images/6b82440f-1c99-4dea-97b2-00d5fb82aa42.jpg","price":"25.99","created_at":1704770189479,"updated_at":1704770189479},{"uuid":"4374ad27-1f50-421e-bf76-1cc74407fd87","title":"The Columbia Anthology of Modern Chinese Drama","publicationDate":"2014-03-25","description":"This condensed anthology reproduces close to a dozen plays from Xiaomei Chen's well-received original collection, The Columbia Anthology of Modern Chinese Drama, along with her critical introduction to the historical, cultural, and aesthetic evolution of twentieth-century Chinese spoken drama. Comprising representative works from the Republican era to postsocialist China, the book encapsulates the revolutionary rethinking of Chinese theater and performance that began in the late Qing dynasty and vividly portrays the uncertainty and anxiety brought on by modernism, socialism, political conflict, and war. Chosen works from 1919 to 1990 also highlight the formation of national and gender identities during a period of tremendous social, cultural, and political change in China and the genesis of contemporary attitudes toward the West. PRC theater tracks the rise of communism, juxtaposing ideals of Chinese socialism against the sacrifices made for a new society. Post-Mao drama addresses the nation's socialist legacy, its attempt to reexamine its cultural roots, and postsocialist reflections on critical issues such as nation, class, gender, and collective memories. An essential, portable guide for easy reference and classroom use, this abridgment provides a concise yet well-rounded survey of China's theatricality and representation of political life. The original work not only established a canon of modern Chinese drama in the West but also made it available for the first time in English in a single volume.","authors":"Xiaomei Chen","category":"drama","imageUrl":"/images/4374ad27-1f50-421e-bf76-1cc74407fd87.jpg","price":"25.99","created_at":1704770190379,"updated_at":1704770190379},{"uuid":"9bfb1d5f-92b0-4f01-a856-23c8a6e46aa6","title":"The Drama of Dance in the Local Church","publicationDate":"2005-07","authors":"Emily Pardue","category":"drama","imageUrl":"/images/9bfb1d5f-92b0-4f01-a856-23c8a6e46aa6.jpg","price":"25.99","created_at":1704770190965,"updated_at":1704770190965},{"uuid":"408b3c87-33ee-4141-9f57-635f7dca1722","title":"Horror and the Horror Film","publicationDate":"2012","description":"'Horror and the Horror Film' is a vivid, compelling, insightful and well-written study of the horror film and its subgenres from 1896 to the present, concentrating on the nature of horror in reality and on film.","authors":"Bruce F. Kawin","category":"horror","imageUrl":"/images/408b3c87-33ee-4141-9f57-635f7dca1722.jpg","price":"25.99","created_at":1704770192353,"updated_at":1704770192353},{"uuid":"84a6ded7-63fb-4341-84ac-c3029d7769c6","title":"The Filmmaker's Book of the Dead","publicationDate":"2015-12-08","description":"Produce, direct, promote and sell your own chilling horror film with real-world advice from award-winning producer/director/writer Danny Draven! The second edition is completely updated with information on new technology, new exclusive interviews with industry pros, new photos and samples from the production of recent horror movies, new behind-the-scenes video, information on modern distribution methods and delivery and more! From the history of horror and the technique of the scare to pre-production and distribution, this complete, full-color guide to filmmaking uncovers all the insider secrets for creating your own spine-tingling horror film from start to finish. The 2nd Edition features all NEW interviews from industry professionals such as: Mick Garris (Sleepwalkers, Bag of Bones, Desperation, The Stand) John Ottman (Composer/Editor of X:Men: Days of Future Past, The Usual Suspects) Mark Ordesky & Jane Fleming (Producers of Lovely Molly, Exists) Kane Hodder (Jason from the Friday the 13th, part 7 to 10, Hatchet) Tibor Takacs (Director of The Gate, Spiders 3D, Megasnake) John Debney (Composer of Predators, Sin City, End of Days) Jojo Draven (Composer of Ghost Month, Reel Evil) Michael Berryman (The Hills Have Eyes, Weird Science) Mike Mendez (Director of The Gravedancers, Big Ass Spider!) Neal Marshall Stevens (Screenwriter of Thir13en Ghosts, Hellraiser: Deader) Chris Alexander (Editor in Chief of Fangoria Magazine) Jessica Cameron (Actress/Director of Truth or Dare) Denise Gossett (Founder of Shriekfest Film Festival) A newly updated companion website that features: *Behind the scenes videos for films films such as Puppet Master, Blood Dolls, Trancers, Subspecies, Reel Evil, Ghost Month and more! *A revised collection of horror movie trailers! * Sample scripts, schedules, storyboards, agreements and more! Other featured interviews include: James Wan (Saw, Insidious, The Conjuring) Robert Englund (Freddy from Nightmare on Elm Street) Robert Kurtzman (From Dusk Til Dawn) Stuart Gordon (Re-Animator, From Beyond, Dagon) Tom Savini (Night of the Living Dead) Lloyd Kaufman (Toxic Avenger) Charles Band (Parasite, Metalstorm, Ghoulies) John D. LeMay (Friday the 13th: The Series) David DeCoteau (Puppet Master 3, Sorority Babes in the Slimball Bowl-O-Rama) Debbie Rochon (Tromeo & Juliet) Reggie Bannister (Phantasm) Sam McCurdy (Director of Photography of Dog Soldiers, The Decent, The Hills Have Eyes 2) Nathan Barr (Composer of Hostel,True Blood, Hemlock Grove) Jim Dooley (Composer of When A Stranger Calls) Chuck Williams (Bubba Ho-Tep) Herschell Gordon Lewis (Blood Feast, Wizard of Gore) H.P. Lovecraft’s Notes on Writing Weird Fiction And many more...","authors":"Danny Draven","category":"horror","imageUrl":"/images/84a6ded7-63fb-4341-84ac-c3029d7769c6.jpg","price":"25.99","created_at":1704770193578,"updated_at":1704770193578},{"uuid":"4b811e6d-9572-4d62-96eb-e31241709ab7","title":"A History of Horror","publicationDate":"2010","description":"Ever since horror leapt from popular fiction to the silver screen in the late 1890s, viewers have experienced fear and pleasure in exquisite combination. A History of Horror, with rare stills from classic films, is the only book to offer a comprehensive survey of this ever-popular film genre. Chronologically examining over fifty horror films from key periods, this one-stop sourcebook unearths the historical origins of legendary characters and explores how the genre fits into the Hollywood studio system and how its enormous success in American and European culture expanded globally over time.","authors":"Wheeler W. Dixon","category":"horror","imageUrl":"/images/4b811e6d-9572-4d62-96eb-e31241709ab7.jpg","price":"25.99","created_at":1704770194586,"updated_at":1704770194586},{"uuid":"88fd32c7-0a1d-4b16-97b1-82ddedef2e8c","title":"Horror Film","publicationDate":"2018-01-25","description":"Throughout the history of cinema, horror has proven to be a genre of consistent popularity, which adapts to different cultural contexts while retaining a recognizable core. Horror Film: A Critical Introduction, the newest in Bloomsbury's Film Genre series, balances the discussions of horror's history, theory, and aesthetics as no introductory book ever has. Featuring studies of films both obscure and famous, Horror Film is international in its scope and chronicles horror from its silent roots until today. As a straightforward and convenient critical introduction to the history and key academic approaches, this book is accessible to the beginner but still of interest to the expert.","authors":"Murray Leeder","category":"horror","imageUrl":"/images/88fd32c7-0a1d-4b16-97b1-82ddedef2e8c.jpg","price":"25.99","created_at":1704770195041,"updated_at":1704770195041},{"uuid":"01968d8e-3a93-44fb-83b0-9ce9078ff277","title":"The Horror Film","publicationDate":"2004-02-09","description":"In this volume, Stephen Prince has collected essays reviewing the history of the horror film and the psychological reasons for its persistent appeal, as well as discussions of the developmental responses of young adult viewers and children to the genre. The book focuses on recent postmodern examples such as The Blair Witch Project. In a daring move, the volume also examines Holocaust films in relation to horror. Part One features essays on the silent and classical Hollywood eras. Part Two covers the postWorld War II era and discusses the historical, aesthetic, and psychological characteristics of contemporary horror films. In contrast to horror during the classical Hollywood period, contemporary horror features more graphic and prolonged visualizations of disturbing and horrific imagery, as well as other distinguishing characteristics. Princes introduction provides an overview of the genre, contextualizing the readings that follow. Stephen Prince is professor of communications at Virginia Tech. He has written many film books, including Classical Film Violence: Designing and Regulating Brutality in Hollywood Cinema, 19301968, and has edited Screening Violence, also in the Depth of Field Series.","authors":"Stephen Prince","category":"horror","imageUrl":"/images/01968d8e-3a93-44fb-83b0-9ce9078ff277.jpg","price":"25.99","created_at":1704770196452,"updated_at":1704770196452},{"uuid":"e909f045-e9c1-4636-9919-a65b477dc4ea","title":"Horror Film Aesthetics","publicationDate":"2014-01-10","description":"This richly informed study analyzes how various cinematic tools and techniques have been used to create horror on screen--the aesthetic elements, sometimes not consciously noticed, that help to unnerve, frighten, shock or entertain an audience. The first two chapters define the genre and describe the use of pragmatic aesthetics (when filmmakers put technical and budgetary compromises to artistic effect). Subsequent chapters cover mise-en-scene, framing, photography, lighting, editing and sound, and a final chapter is devoted to the aesthetic appeals of horror cinema. Instructors considering this book for use in a course may request an examination copy here.","authors":"Thomas M. Sipos","category":"horror","imageUrl":"/images/e909f045-e9c1-4636-9919-a65b477dc4ea.jpg","price":"25.99","created_at":1704770197201,"updated_at":1704770197201},{"uuid":"643c55b2-7fdf-46b0-8a0f-2e50aa22665d","title":"Untold Horror","publicationDate":"2021-08-31","description":"Insightful interviews of horror legends George Romero, John Landis, Joe Dante, Brian Yuzna, and more, by former editor-in-chief of Rue Morgue, Dave Alexander, about the scariest horror movies never made! Take a behind-the-scenes look into development hell to find the most frightening horror movies that never were, from unmade Re-Animator sequels to alternate takes on legendary franchises like Frankenstein and Dracula! Features art, scripts, and other production material from unmade films that still might make you scream--with insights from dozens of directors, screenwriters, and producers with decades of experience. Featured Interviews With: George A. Romero John Landis Joe Dante Vincenzo Natali Brian Yuzna William Lustig William Malone Buddy Giovinazzo Tim Sullivan Richard Raaphorst Ruggero Deodato Jim Shooter Bob Layton David J. Skal","authors":"George. A Romero, John Landis, Dave Alexander, Joe Dante, Brian Yuzna","category":"horror","imageUrl":"/images/643c55b2-7fdf-46b0-8a0f-2e50aa22665d.jpg","price":"25.99","created_at":1704770197547,"updated_at":1704770197547},{"uuid":"33ab82d7-6dfd-47e1-930f-494a088f0b26","title":"Horror","publicationDate":"2009-02-09","description":"Horror cinema is a hugely successful, but at the same time culturally illicit genre that spans the history of cinema. It continues to flourish with recent cycles of supernatural horror and torture porn that span the full range of horror styles and aesthetics. It is enjoyed by audiences everywhere, but also seen as a malign influence by others. In this Routledge Film Guidebook, audience researcher and film scholar Brigid Cherry provides a comprehensive overview of the horror film and explores how the genre works. Examining the way horror films create images of gore and the uncanny through film technology and effects, Cherry provides an account of the way cinematic and stylistic devices create responses of terror and disgust in the viewer. Horror examines the way these films construct psychological and cognitive responses and how they speak to audiences on an intimate personal level, addressing their innermost fears and desires. Cherry further explores the role of horror cinema in society and culture, looking at how it represents various identity groups and engages with social anxieties, and examining the way horror sees, and is seen by, society.","authors":"Brigid Cherry","category":"horror","imageUrl":"/images/33ab82d7-6dfd-47e1-930f-494a088f0b26.jpg","price":"25.99","created_at":1704770198078,"updated_at":1704770198078},{"uuid":"11235356-1c7e-4945-9fdc-502e3dfa3c64","title":"80’s The Gold Decade Of The Horror Movie","publicationDate":"2014-11-18","description":"A journey into the numerous Horror Films of the 80's analyzed under a \"religious\" profile which is purely Catholic. The diversification of the analysis is, of course, an issue that interests us. In fact, of all the films taken into consideration, this journey not only gives a brief opinion of the film, but it also shows the depth and thoughts shared and prepared by the Catholic Cinematographic Center. This Centre analyzes the plot and also evaluates the film under an ethical, moral and religious aspect in order to indicate if Catholics are able to watch it. The result is a really interesting insight and sometimes it has a fun perspective. We must acknowledge, however, that the critical Catholic knows how to diversify religious opinion from the technical-creative aspects. This means that a film can be recognized as a masterpiece but not get the clearance for visibility. 65 deepened critical articles of the most important films of the decade. Over 9000 Horror Movies from 1980 to 1989 linked to external resources for Cast, Posters, Images and Reviews. The electronic version of this book is designed in Kindle, PDF and Epub format. This is an interactive book. An Internet connection is not essential although it is recommended so the reader can take advantage of the many external links that are present in the work.","authors":"Matteo Tortora","category":"horror","imageUrl":"/images/11235356-1c7e-4945-9fdc-502e3dfa3c64.jpg","price":"25.99","created_at":1704770198697,"updated_at":1704770198697},{"uuid":"be30f2ea-58e2-48b2-a2f0-d56cab61156e","title":"Lost in the Dark","publicationDate":"2021","description":"A comprehensive and fun overview of moviegoers' favorite genre","authors":"Brad Weismann","category":"horror","imageUrl":"/images/be30f2ea-58e2-48b2-a2f0-d56cab61156e.jpg","price":"25.99","created_at":1704770198924,"updated_at":1704770198924},{"uuid":"3e1ba1c2-30bc-4b2c-95b9-6f7697da397d","title":"An Introduction to Medieval Romance","publicationDate":"1930","authors":"Albert Booth Taylor","category":"romance","imageUrl":"/images/3e1ba1c2-30bc-4b2c-95b9-6f7697da397d.jpg","price":"25.99","created_at":1704770199792,"updated_at":1704770199792},{"uuid":"d912a0f5-943f-463d-a7ab-3d341f782b8c","title":"Romance","publicationDate":"2018-05-15","description":"Reproduction of the original: Romance by Walter Raleigh","authors":"Walter Raleigh","category":"romance","imageUrl":"/images/d912a0f5-943f-463d-a7ab-3d341f782b8c.jpg","price":"25.99","created_at":1704770200344,"updated_at":1704770200344},{"uuid":"79c91c37-f494-4bf6-b637-7660b99614fd","title":"The Prize (Enemies-to-Lovers Romance)","description":"Written by USA Today Bestselling Author K.L. Middleton ﻿Adam Knight wasn't just my first kiss. He was the cruel, heartless jerk who lived to torment me after I bruised his ego in front of his friends. He hated me for it and made my high school years intolerable. But... I survived and we eventually went our separate ways. Until I bought a stupid raffle ticket. I’m not going to lie – I was a dick to Chloe Maverick and she has every right not to forgive me. But I’m no longer the immature prick I used to be. I’m a man now and she’s… she’s all woman. She might not be able to let the past go But... I refuse to let that stop us from having a future. When Chloe Maverick transfers to Diamond Lake University, she is talked into attending a fundraiser and finds herself winning the main raffle. The prize? An all inclusive weekend vacation with a local web celebrity - an arrogant, bullheaded jerk she knew in high school. Unfortunately, she can't get out of the date and Adam hasn't changed much, except for maybe getting irritatingly more handsome. After getting injured in the Daytona 500, Adam Knight thought he'd never experience the kind of rush he'd lived for on the track. That is until he started chasing after ghosts. Now he finds himself face-to-face with the girl who shamed him in high school. She's still as feisty, untouchable, and beautiful as ever. She's also his date for an entire weekend at the resort of his choice - a luxurious hotel in California... that's said to be haunted. Unfortunately, Chloe can't seem to let go of the past, but Adam is determined to win her over, catch himself a ghost, and lay their demons to rest. Topics: contemporary romance, romantic comedy, royal romance, billionaire romance, billionaire, series, romantic comedy series, comedy, comedy series, interracial romance, funny romance, laugh romance, modern romance, urban romance, new york, new york romance, wealthy, USA today, USA today bestseller, Prince romance, neighbor romance, best friends to lovers romance, city romance, smart romance, undercover bodyguard, neighbors romance, roommate romance, something funny to read, best friends in romance, brothers, Kinds, royalty, lighthearted romance, light romance, hot romance, nana malone, nana malone romance, proposal, proposal romance, engagement, engagement romance, free ebook, freebie, free book, free reads, free romance novel, free romance book, free billionaire book, romantic comedy books free, romance books free, billionaire romance for adults, billionaire romance books, contemporary romance free, funny romance, funny romance free, funny books free, comedy books free, rom com, hilarious, romance series, romance series, romance books, beach reads, new adult, college, funny, female, stories, sensual, sensual romance, alpha male, dominant male, hot guy, racy, billionaire romance free, sexy, heartwarming, heart-warming, family, love, love books, kissing books, emotional journey, contemporary, contemporary romance, romance series, long series, long romance series, wealthy hero, wealthy heroes, sassy, captivating romance, hot, hot romance, forbidden love, sparks, loyalty, swoon, mystery, action adventure romance, romantic suspense, suspense romance, action scene romance, action adventure romance.","authors":"K.L. Middleton, Cassie Alexandra","category":"romance","imageUrl":"/images/79c91c37-f494-4bf6-b637-7660b99614fd.jpg","price":"25.99","created_at":1704770200637,"updated_at":1704770200637},{"uuid":"3ec3b46b-963a-44d0-9c55-f8aa8dd8f00f","title":"Her Dark Secret","publicationDate":"2020-03-25","description":"Enjoy this bad boy billionaire romance. She is the last person I should fall in love with ... And yet it was inevitable. The moment I set eyes on Temple Dubois, I knew I had to have her. Her beautiful face, her smile, the body that haunts my dreams. I need her in my bed, in my life. The scent of her skin, the way the curves of her body cling to me ... God, she's incredible. And a virgin ... Before I'm done with her, I'll make sure she's as insatiable as I am ... what am I saying? I'll never be done with her. She's my life now ... Keywords: Billionaire romance, bad boy, new adult, instalove, age gap romance, alpha male, new adult romance, steamy romance, age gap romance older man younger woman, sweet romance, romantic novels, love, action, adventure, sexually romantic books, hot, alpha hero, contemporary romance, guaranteed HEA, no cliffhangers, sweet romance, love books, love stories.","authors":"Michelle Love","category":"romance","imageUrl":"/images/3ec3b46b-963a-44d0-9c55-f8aa8dd8f00f.jpg","price":"25.99","created_at":1704770200942,"updated_at":1704770200942},{"uuid":"b52e5ca5-815d-42bc-9f6d-0caf1cb327d2","title":"Medieval Romance: Themes and Approaches","publicationDate":"1973","authors":"John Stevens","category":"romance","imageUrl":"/images/b52e5ca5-815d-42bc-9f6d-0caf1cb327d2.jpg","price":"25.99","created_at":1704770201461,"updated_at":1704770201461},{"uuid":"ff4cc4f2-5afa-49c8-a681-f41ea2b0df8e","title":"The Mammoth Book of Time Travel Romance","publicationDate":"2009-10-29","description":"Time travel romance is not the same thing as sci-fi romance, though some stories may be set in an imagined future; it is romantic fiction set in various different eras, usually from around the sixteenth to the eighteenth centuries. A woman may fall asleep in Central Park in the present to wake up in the arms of a Scottish laird in the sixteenth century. The Mammoth Book of Time Travel Romance contains 25 stories of adventure and love; settings include medieval Scotland, sixteenth-century England, the nineteenth-century 'Wild West'. Some stories are set in the present and a few in the future. Stories include an Elizabethan nobleman whisked into the present day, a troubled young woman who lands in the sixteenth century able to break a curse of lost love. Includes stories from: Nina Bangs, Jude Deveraux, Sandra Hill, Linda Howard, Lynn Kurland, Karen Marie Moning, and many more.","authors":"Trisha Telep","category":"romance","imageUrl":"/images/ff4cc4f2-5afa-49c8-a681-f41ea2b0df8e.jpg","price":"25.99","created_at":1704770202090,"updated_at":1704770202090},{"uuid":"f5bfec40-9080-45c6-b931-09df040ad99e","title":"שפירית בענבר","publicationDate":"2012","authors":"Diana Gabaldon, דיאנה גבלדון, ארז אשׁרוב","category":"romance","imageUrl":"/images/NOT_FOUND.jpg","price":"25.99","created_at":1704770202091,"updated_at":1704770202091},{"uuid":"c8d70f50-77ff-4cb7-aa07-39523e224b1d","title":"Comparative Romance Linguistics Newsletter","publicationDate":"1960","authors":"","category":"romance","imageUrl":"/images/c8d70f50-77ff-4cb7-aa07-39523e224b1d.jpg","price":"25.99","created_at":1704770202329,"updated_at":1704770202329},{"uuid":"01251ac8-c2dc-4234-b83d-8907891c295c","title":"Harlequin Western Romance January 2017 Box Set","publicationDate":"2017-01-01","description":"Romance—the Western way! Harlequin Western Romance brings you a collection of four new heartwarming contemporary romances of everyday women finding love. Available now! This box set includes: HER COLORADO SHERIFF Newly hired as interim sheriff of Hidden Springs, Colorado, Cullen Brannigan plans to move into a house on the family ranch…except he finds it’s already occupied by Shelby Townsend and her five-year-old nephew! A VALENTINE FOR THE COWBOY Sapphire Mountain Cowboys • by Marie Ferrarella Rancher Eli Clayton is raising his little fourteen-month-old daughter, Libby. When he sees her happily ensconced in the arms of a beautiful stranger, he begins to wonder if his daughter needs a mommy…and if he needs a wife! THE BULL RIDER'S COWGIRL Men of Raintree Ranch • by April Arrington When easy-living bull rider Colt Mead becomes his young sister’s guardian, he needs Jen Taylor’s help. But it will take more than friendship to convince the determined barrel racer to give up her race for glory. RODEO FATHER by Mary Sullivan Cowboy Travis Read has always been a loner. But when he meets Rachel McGuire, the pregnant widow and her daughter make him believe being part of a family might be possible after all!","authors":"Patricia Thayer, Rebecca Winters, April Arrington, Mary Sullivan","category":"romance","imageUrl":"/images/01251ac8-c2dc-4234-b83d-8907891c295c.jpg","price":"25.99","created_at":1704770203468,"updated_at":1704770203468},{"uuid":"ba20eda2-55e6-4ef9-99b3-1f6003d2101f","title":"Harlequin Western Romance May 2018 Box Set","publicationDate":"2018-05-01","description":"Romance—the Western way! Harlequin® Western Romance brings you four new heartwarming contemporary romances of everyday women finding love in one collection! This box set includes: TO TRUST A RANCHER Made in Montana by Debbi Rawlins A vicious lie drove Becca Hartman from Blackfoot Falls, Montana. Now she’s home and facing a heartbreaking choice. Can Becca trust rancher Ryder Mitchell with the secret that could tear her life apart? HER COWBOY’S TRIPLETS The Boones of Texas by Sasha Summers India Boone is determined to build a new life for her and her son, independent of others. But Brody Wallace’s attentions are hard to resist…and then there are his adorable toddler triplet daughters! THE BULL RIDER’S BABY BOMBSHELL Saddle Ridge, Montana by Amanda Renee Champion bull rider and confirmed bachelor Wes Slade donated sperm so a friend could have a baby. Now she’s missing and her sister, Jade, is desperate to find her—while caring for his triplets! RODEO FAMILY Rodeo, Montana by Mary Sullivan An investigative journalist has finally uncovered the story sure to propel her out of her Montana hometown and back to her career in NYC. Trouble is, she’s falling for the cowboy she’s supposed to be reporting on! Look for 4 compelling new stories every month from Harlequin® Western Romance!","authors":"Debbi Rawlins, Sasha Summers, Amanda Renee, Mary Sullivan","category":"romance","imageUrl":"/images/ba20eda2-55e6-4ef9-99b3-1f6003d2101f.jpg","price":"25.99","created_at":1704770204216,"updated_at":1704770204216}]